brew 'zsh'
brew 'oh-my-posh'
brew 'zoxide'
brew 'kubectl'
brew 'kubectx'
brew 'autoenv'
brew 'eza'
brew 'fzf'
brew 'k9s'
brew 'ansible' 
brew 'mise'
brew 'neovim'
brew 'ripgrep'
brew 'fd'
brew 'tree-sitter-cli'
brew 'stow'
brew 'keychain'
