# terminal
brew 'zsh'
brew 'oh-my-posh'
brew 'zoxide'
brew 'neovim'
brew 'autoenv'
brew 'eza'
brew 'fzf'
brew 'ripgrep'
brew 'fd'
brew 'tree-sitter-cli'
brew 'stow'
brew 'yazi'
brew 'tmux'
brew 'bat'
brew 'commitizen'
brew 'keychain' if OS.linux?

# k8s
brew 'kubectl'
brew 'kubectx'
brew 'k9s'
brew 'kubelogin'
brew 'helm'
brew 'cilium-cli'
brew 'argocd'
brew 'kyverno'

# package managers
brew 'mise'

# devops
brew 'ansible'
brew 'opentofu'
brew 'terraform'
brew 'vault-cli'
brew 'buildkit'

# utility
brew 'borders' if OS.mac?
brew 'htop'

# casks
cask 'firefox'
cask 'brave-browser'
cask 'obsidian'
cask 'discord'
cask 'ghostty'
cask 'aerospace'
cask 'betterdisplay'
cask 'keka'
cask 'kap'
cask 'slack'
cask 'signal'
cask 'vlc'
cask 'raycast'
cask 'proton-mail'
cask 'protonvpn'
cask 'synology-drive'
cask 'visual-studio-code'
cask 'steam'
cask 'font-jetbrains-mono-nerd-font'

# App Store
mas 'tachimanga',id: 6447486175
mas 'readest-ebook-reader',id: 6738622779
